/*Напишете програма, която намира най-голямото от лицата на няколко правоъгълника, 
ако знаете броя n (1<n<100) и размерите (дължина и ширина) на правоъгълниците. 
На отделен ред да се изведат и размерите на правоъгълника с най-голямо лице. 
Ако има няколко правоъгълника с най-голямо лице, да се изведат размерите на всички.*/
#include <iostream>
#include <stdlib.h>
using namespace std;

void main() {
    system("chcp 1251");
    int n, i; float a[100], b[100], S[100], maxS = 0;
    cout << " въведете брой на правоъгълниците: "; cin >> n;
    cout << " въведете размери на страните: " << "\n";

    for (i = 0; i < n; i++)
    {
        S[i] = 1;
        cout << " a" <<i<< " = "; cin >> a[i]; 
        cout << " b" <<i<< " = "; cin >> b[i]; cout <<endl;
        S[i] *= a[i] * b[i];
        if (S[i] > maxS) maxS = S[i];
    }
    
    cout << " най-голямото лице е: " << maxS << endl;
    for (i = 0; i < n; i++)
    {
        if (maxS == S[i])
            cout << " при a" << i << " = " << a[i] << " и b" << i << " = " << b[i] << endl;
    }
}
